{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "segmentation_model",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 27, 48, 1],
            "dtype": "float32",
            "sparse": false,
            "name": "input_layer"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "filters": 16,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "activation": "relu"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_2",
            "trainable": true,
            "filters": 8,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "activation": "relu"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "output_layer",
            "trainable": true,
            "filters": 1,
            "kernel_size": [1, 1],
            "strides": [1, 1],
            "padding": "same",
            "activation": "sigmoid"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [3, 3, 1, 16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/kernel",
          "shape": [3, 3, 16, 8],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/bias",
          "shape": [8],
          "dtype": "float32"
        },
        {
          "name": "output_layer/kernel",
          "shape": [1, 1, 8, 1],
          "dtype": "float32"
        },
        {
          "name": "output_layer/bias",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  ]
}
